[
    {
      "id": "1",
      "type": "T-Shirts",
      "image": "/assets/images/img_men1.jpg",
      "alt": "Graphic T-Shirt",
      "name": "Graphic T-Shirt",
      "description":"A graphic t-shirt is a casual, statement-making garment that features bold, eye-catching designs or artwork printed on the front or back. These designs can include anything from logos, illustrations, and band graphics to slogans, pop culture references, or abstract art. Graphic t-shirts come in a wide range of styles, from vintage-inspired designs to contemporary, minimalist prints, making them versatile and expressive pieces for any casual outfit.Made from soft cotton or cotton-blend fabrics, graphic t-shirts are comfortable and breathable, ideal for layering or wearing on their own in warm weather. They typically feature a crew neck or v-neck and can be found in various fits, from regular to slim or oversized. Graphic t-shirts are perfect for creating a laid-back, youthful look and are easy to pair with jeans, shorts, or casual trousers. For a relaxed look, pair a graphic t-shirt with denim jeans or joggers and sneakers. For a slightly more stylish outfit, combine it with a denim jacket or blazer and boots. They are also popular for expressing personal interests, hobbies, or affiliations, making them a fun and creative addition to your wardrobe. Whether you prefer subtle, artistic designs or loud, bold graphics, a graphic t-shirt is an easy way to inject personality and style into your everyday outfits.",
      "price": 499,
      "rating": 4.2,
      "stock": 15,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false
    },
    {
      "id": "2",
      "type": "Shirts",
      "image": "/assets/images/img_men2.jpg",
      "alt": "Casual Shirt",
      "name": "Casual Shirt",
      "description":"Description: Embrace effortless style with our Casual Lush Green Shirt, designed for a laid-back yet polished look. Crafted from a soft, breathable fabric, this shirt offers ultimate comfort while keeping you cool and relaxed throughout the day. The rich lush green color adds a vibrant touch to your wardrobe, making it perfect for both casual outings and weekend get-togethers.With a classic button-down front and a relaxed fit, this shirt provides a flattering silhouette without compromising on comfort. Its versatile design allows it to be easily paired with jeans, chinos, or even shorts, making it the go-to piece for a variety of occasions. Whether you're enjoying a casual day out or meeting friends for a coffee, this lush green shirt is sure to become your favorite wardrobe staple.Style Tip: Pair it with dark jeans for a balanced look, or go for a laid-back vibe with chinos or shorts. For an even more casual style, roll up the sleeves and leave the top button undone.",
      "price": 899,
      "rating": 4.5,
      "stock": 8,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "3",
      "type": "Jeans",
      "image": "/assets/images/img_men3.jpg",
      "alt": "Blue Denim Jeans",
      "name": "Blue Denim Jeans",
      "description":"Blue denim jeans are a wardrobe staple made from durable, high-quality cotton denim fabric, traditionally dyed with indigo for a classic blue tone. They typically feature a timeless five-pocket design, reinforced stitching, and metal rivets for extra durability. These jeans are versatile and come in a wide range of fits, including slim, straight, skinny, relaxed, and bootcut, catering to different preferences and body types. With options in various washes—ranging from light to dark, distressed, or raw—they suit diverse occasions, from casual outings to semi-casual events. Known for their comfort and adaptability, blue denim jeans remain an iconic piece of fashion.",
      "price": 1299,
      "rating": 4.0,
      "stock": 12,
      "button": "Add to Cart",
      "sizes": ["26", "28", "30", "32", "34", "36", "38", "40"],
      "newArrival": false

    },
    {
      "id": "4",
      "type": "Jackets",
      "image": "/assets/images/img_men4.jpg",
      "alt": "Winter Jacket",
      "name": "Winter Jacket",
      "description":"A leather winter jacket is a stylish and functional outerwear piece made from genuine or faux leather, designed to provide warmth and durability during colder months. Often lined with insulating materials like fleece, shearling, or quilted padding, it offers excellent protection against harsh weather while maintaining a sleek and sophisticated look. Common styles include bomber jackets, biker jackets, and parkas, featuring zippered or buttoned closures, high collars, and sometimes detachable hoods for added versatility. To style it, pair a black or brown leather jacket with a crew-neck sweater, slim-fit jeans, and boots for a classic casual look, or combine it with a turtleneck, dark trousers, and leather loafers for a more polished appearance. For extra warmth and a modern vibe, layer it over a hoodie or flannel shirt and accessorize with a chunky knit scarf, leather gloves, or a beanie. Neutral tones like black or brown are versatile and timeless, while bold shades like burgundy or navy can add a standout element to your winter wardrobe. A leather winter jacket effortlessly blends practicality with fashion, making it an essential piece for cold-weather style.",
      "price": 2499,
      "rating": 4.8,
      "stock": 6,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false

    },
    {
      "id": "5",
      "type": "Sweaters",
      "image": "/assets/images/img_men5.jpg",
      "alt": "Woolen Sweater",
      "name": "Woolen Sweater",
      "description":"A woolen sweater is a warm, comfortable garment made from wool fibers, known for its insulating properties that help retain body heat in colder weather. Wool is naturally breathable, moisture-wicking, and soft, making it ideal for layering during winter months. Woolen sweaters come in various styles, including crew neck, V-neck, turtleneck, and cardigan, and can feature patterns such as cable knit, Fair Isle, or ribbed designs for added texture. Available in a range of colors and weights, from lightweight merino wool to thicker, coarser wool, these sweaters offer both style and functionality. Wool is also known for its durability, as it resists wear and tear, making it a long-lasting addition to any wardrobe. Paired with jeans, skirts, or trousers, a woolen sweater can be dressed up or down, providing versatility for both casual and semi-formal occasions.",
      "price": 1199,
      "rating": 3.9,
      "stock": 10,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false
    },
    {
      "id": "6",
      "type": "Shirts",
      "image": "/assets/images/img_men6.jpg",
      "alt": "White Shirt",
      "name": "White Linen Shirt",
      "description":"Description: Our Classic White Linen Shirt is the perfect addition to your wardrobe for any season. Made from 100% natural linen, this shirt is designed to provide both comfort and style. The breathable and lightweight fabric ensures you stay cool during warmer days, while the crisp white color gives it a clean, sophisticated look suitable for both casual and semi-formal occasions.The timeless design features a button-down front, a tailored fit, and a single chest pocket for added functionality. Whether you're heading to a summer barbecue, a beach vacation, or a smart-casual dinner, this versatile linen shirt will keep you looking effortlessly sharp.",
      "price": 799,
      "rating": 4.1,
      "stock": 20,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "7",
      "type": "Jeans",
      "image": "/assets/images/img_men7.jpg",
      "alt": "Pants",
      "name": "Beige Pant",
      "description":"Beige men’s pants are a versatile wardrobe staple, offering a neutral and timeless color that pairs easily with a wide range of tops and accessories. Made from various fabrics such as cotton, chinos, or linen, beige pants are comfortable and breathable, making them ideal for both warm and cooler weather. These pants come in a variety of styles, including slim-fit, straight-leg, or relaxed cuts, and can feature details such as pleats, flat fronts, or cuffed hems. Beige pants are perfect for casual settings when paired with a t-shirt or polo, but they can also be dressed up for more formal occasions with a button-down shirt or blazer. Their adaptability allows them to be worn in both professional and laid-back environments, making them a go-to choice for a wide range of outfits. Whether worn with loafers, sneakers, or boots, beige pants offer effortless style and a fresh, clean look.",
      "price": 899,
      "rating": 4.3,
      "stock": 18,
      "button": "Add to Cart",
      "sizes": ["26", "28", "30", "32", "34", "36", "38", "40"],
      "newArrival": false
    },
    {
      "id": "8",
      "type": "Shirts",
      "image": "/assets/images/img_men8.jpg",
      "alt": "Cotton Shirt",
      "name": "Cotton Gray Shirt",
      "description":"Description: Our Cotton Gray Shirt is the epitome of understated elegance and versatility. Made from soft, high-quality cotton fabric, this shirt offers both comfort and durability, ensuring you look and feel great all day long. The neutral gray color adds a sophisticated, modern touch to your wardrobe, making it perfect for both casual and semi-formal occasions.The breathable cotton material keeps you cool and comfortable, while the classic button-down design gives it a timeless appeal. With a tailored fit and sleek finish, this shirt is ideal for layering or wearing on its own. Pair it with jeans, chinos, or even dress pants for a refined look that never goes out of style. Style Tip: For a polished look, pair this shirt with dark trousers or chinos. For a more casual style, roll up the sleeves and team it with your favorite jeans or shorts. This shirt also works great under a blazer or cardigan for a stylish layering option.",
      "price": 799,
      "rating": 4.0,
      "stock": 9,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false
    },
    {
      "id": "9",
      "type": "Shirts",
      "image": "/assets/images/img_men9.jpg",
      "alt": "Checked Shirt",
      "name": "Checked Gray Shirt",
      "description":"Description: Add a touch of classic style to your wardrobe with our Checked Gray Shirt. Crafted from soft, high-quality cotton, this shirt features a timeless checkered pattern in shades of gray, offering a sophisticated yet casual look. Perfect for both workdays and weekends, it can easily be dressed up or down to suit any occasion.The lightweight fabric ensures comfort throughout the day, while the structured fit provides a sharp, clean silhouette. Whether you're pairing it with jeans for a laid-back look or dressing it up with chinos for a more polished outfit, this shirt effortlessly adds style to your collection.",
      "price": 699,
      "rating": 3.8,
      "stock": 25,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false
    },
    {
      "id": "10",
      "type": "Co-ords",
      "image": "/assets/images/img_men10.jpg",
      "alt": "Shirt and Pant",
      "name": "Cotton Shirt and Linen Pant",
      "description":"A cotton shirt paired with linen pants creates a comfortable, breathable, and stylish combination perfect for warmer weather or casual occasions. The cotton shirt, soft and versatile, is known for its moisture-wicking properties, making it ideal for keeping cool. It can be found in various styles, including button-down, polo, or casual short-sleeve, and is available in a range of colors and patterns like solids, stripes, or checks. Linen pants, on the other hand, are lightweight and airy, offering excellent breathability. Their relaxed, often slightly wrinkled texture gives them a laid-back yet sophisticated vibe. Linen pants typically come in loose or straight-leg cuts, and their natural fibers make them perfect for both beachside outings or evening dinners in warmer climates.When paired together, the cotton shirt and linen pants offer a laid-back, summery look. For a casual outfit, tuck a crisp white cotton button-down shirt into beige or navy linen pants and pair with loafers or casual sneakers. For a more elevated look, add a slim-fit cotton shirt in a pastel or light pattern and combine it with tailored linen pants for a fresh, stylish appearance. This combination is effortlessly versatile, offering comfort and style whether you’re at a summer gathering, on vacation, or simply enjoying a relaxed day out.",
      "price": 1499,
      "rating": 4.4,
      "stock": 7,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "11",
      "type": "Shirts",
      "image": "/assets/images/img_menShirt1.jpg",
      "alt": "Shirt",
      "name": "Satin Baby Blue Shirt",
      "description":"Description: Elevate your wardrobe with the luxurious Satin Baby Blue Shirt, designed to add a touch of elegance and sophistication to any outfit. Made from smooth, high-quality satin fabric, this shirt boasts a soft sheen and a rich, refreshing baby blue color that is both calming and stylish. Perfect for a variety of occasions, this shirt combines comfort with a refined, polished look.The lightweight satin material drapes beautifully over your body, providing a flattering fit that works well with both formal and casual styles. Whether worn on its own or layered under a jacket or sweater, this shirt is versatile enough to take you from day to night with ease. Style Tip: Pair with tailored trousers or dark jeans for a sleek, modern ensemble. For a more refined look, tuck it into a suit or wear it with a skirt for a feminine touch. Add minimalistic jewelry to complement the smooth texture of the satin.",
      "price": 699,
      "rating": 4.0,
      "stock": 12,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "12",
      "type": "Shirts",
      "image": "/assets/images/img_menShirt2.jpg",
      "alt": "Shirt",
      "name": "Striped Shirt",
      "description":"Description: Classic yet contemporary, the Striped Blue and White Shirt is a wardrobe essential that brings a fresh and stylish flair to your everyday look. Featuring alternating stripes in a crisp blue and white pattern, this shirt offers a timeless appeal while maintaining a modern edge. Whether you're dressing up for a day at the office or going for a laid-back weekend look, this shirt is perfect for any occasion.Crafted from a soft cotton blend, the shirt ensures all-day comfort, while its breathable fabric keeps you feeling fresh and confident throughout the day. The combination of the sharp stripes and tailored fit offers a flattering silhouette for all body types. Style Tip: Pair with dark denim or chinos for a balanced, sharp look. For a more casual vibe, roll up the sleeves and pair with sneakers or loafers. Add a leather belt for extra style points.",
      "price": 799,
      "rating": 4.3,
      "stock": 9,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "13",
      "type": "Shirts",
      "image": "/assets/images/img_menShirt3.jpg",
      "alt": "Shirt",
      "name": "Pink Shirt",
      "description":"Description: Elevate your wardrobe with this versatile Pink Shirt, designed to bring a burst of color to your collection. The soft pink hue gives off a refreshing and stylish vibe, making it perfect for both casual and semi-formal occasions. Its minimalist design and classic fit ensure it pairs effortlessly with a variety of outfits, from tailored trousers to your favorite jeans.Crafted from high-quality, breathable fabric, this shirt offers exceptional comfort while maintaining a sharp, polished look. The smooth texture feels gentle against the skin, making it ideal for all-day wear. Whether you're dressing up for work or enjoying a weekend outing, this pink shirt will add a touch of elegance to your ensemble. Style Tip: Pair with beige or gray trousers for a soft, sophisticated outfit. For a more casual look, go for denim or chinos and a pair of loafers or sneakers.",
      "price": 899,
      "rating": 3.7,
      "stock": 6,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false
    },
    {
      "id": "14",
      "type": "Co-ords",
      "image": "/assets/images/img_menShirt4.jpg",
      "alt": "Shirt",
      "name": "Blue Shirt and Grey Pants",
      "description":"A blue shirt paired with grey pants creates a classic, polished, and versatile outfit suitable for various occasions. The blue shirt, whether in a rich navy, vibrant cobalt, or soft pastel, adds a pop of color while remaining refined. It can be worn as a button-down shirt, polo, or even a casual short-sleeve, depending on the setting. Blue is a versatile hue that pairs well with many other colors, and it complements grey perfectly, creating a balanced look.Grey pants, whether in light grey, charcoal, or medium grey, are a neutral and sophisticated choice that can be dressed up or down. They can range from casual chinos to more formal dress pants, offering flexibility depending on the occasion. The neutrality of grey allows the blue shirt to stand out while keeping the overall outfit harmonious.For a casual look, pair a light blue shirt with light grey chinos and sneakers for a relaxed yet stylish appearance. For a more formal setting, a navy blue shirt with charcoal grey dress pants and loafers or oxford shoes can offer a sharp, professional look. This combination works well for both office environments and social gatherings, making it a go-to pairing for a versatile and well-balanced outfit.",
      "price": 1699,
      "rating": 4.6,
      "stock": 8,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false
    },
    {
      "id": "15",
      "type": "Co-ords",
      "image": "/assets/images/img_menShirt5.jpg",
      "alt": "Shirt",
      "name": "Blue Shirt and Off-White Pant",
      "description":"A blue shirt paired with off-white pants creates a stylish and sophisticated look that is both fresh and versatile. The blue shirt, whether in navy, sky blue, or a light pastel shade, offers a pop of color and can be worn in a variety of styles, from casual button-downs to dressy long sleeves. Blue is a flattering and dynamic color that contrasts nicely with the neutral tone of off-white, creating a balanced and clean appearance.Off-white pants, which can range from light beige to cream, add a soft, elegant touch to the outfit. These pants are ideal for warmer weather, as they reflect light and keep you cool while offering a modern yet timeless appeal. Off-white pants are versatile and can be found in various styles, such as chinos, slim-fit trousers, or even casual linen pants, making them suitable for both casual and semi-formal settings.For a relaxed, casual look, you can pair a light blue shirt with off-white chinos and loafers or casual sneakers. For a more refined outfit, a navy blue shirt with off-white dress pants or tailored trousers, paired with brown or black leather shoes, creates a polished and sophisticated appearance perfect for business or evening events. This combination offers an effortlessly stylish and fresh aesthetic, ideal for spring or summer occasions.",
      "price": 1599,
      "rating": 4.5,
      "stock": 10,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "16",
      "type": "Co-ords",
      "image": "/assets/images/img_menShirt6.jpg",
      "alt": "Shirt",
      "name": "Black Shirt and Beige Pant",
      "description":"A black shirt paired with beige pants creates a stylish, modern, and balanced look that can be dressed up or down for a variety of occasions. The black shirt adds a bold, sleek element to the outfit, offering a sense of sophistication and versatility. Whether it’s a casual black t-shirt, a dressy button-down, or a stylish polo, the black shirt serves as a strong base for the rest of the ensemble. Black pairs effortlessly with almost any color, and when combined with beige pants, it creates a sharp contrast that’s both eye-catching and refined.Beige pants, whether in chinos, tailored trousers, or even casual linen styles, offer a light, neutral tone that balances the darkness of the black shirt. Beige is a versatile color that complements the richness of black, making the outfit look fresh and modern. The neutral nature of beige makes it suitable for both casual and semi-formal settings.For a laid-back, casual outfit, you could pair a black t-shirt with beige chinos or jeans and finish the look with sneakers or loafers. For a more polished look, a black button-down shirt with beige dress pants or tailored chinos, paired with dress shoes or boots, creates a sharp, sophisticated appearance ideal for business meetings or evening outings. This combination is timeless, versatile, and suitable for a range of styles and occasions.",
      "price": 1549,
      "rating": 4.2,
      "stock": 12,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false

    },
    {
      "id": "17",
      "type": "Shirts",
      "image": "/assets/images/img_menShirt7.jpg",
      "alt": "Shirt",
      "name": "Linen Green Shirt",
      "description":"Description: Refresh your wardrobe with this Linen Green Shirt, the perfect combination of comfort, style, and breathability. Crafted from 100% natural linen, this shirt offers a relaxed yet sophisticated look that’s ideal for warm weather or casual outings. The soft green hue brings a touch of nature and tranquility to your outfit, making it a versatile piece that pairs well with both neutral and vibrant colors.The lightweight and breathable linen fabric keeps you cool throughout the day, while the shirt's timeless design ensures it remains a staple in your wardrobe for seasons to come. Whether you're heading to a beachside brunch or an afternoon stroll, this green linen shirt offers both style and comfort.Style Tip: Pair with white or beige trousers for a chic, understated look. Add loafers or boat shoes to complete the relaxed, yet polished appearance.",
      "price": 799,
      "rating": 4.0,
      "stock": 15,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "18",
      "type": "Shirts",
      "image": "/assets/images/img_menShirt8.jpg",
      "alt": "Brown Shirt",
      "name": "Brown Shirt",
      "description":"Description: Step into timeless elegance with this Brown Shirt, a versatile and stylish wardrobe staple perfect for any occasion. Crafted from high-quality fabric, this shirt offers a smooth and comfortable fit while maintaining a rich and sophisticated appearance. The warm brown tone adds depth and character, making it a great choice for both formal and casual wear.Whether you're dressing up for a business meeting or dressing down for a weekend outing, this brown shirt is a dependable choice. The classic design and subtle color make it easy to pair with jeans, chinos, or tailored trousers, providing an effortless yet polished look.Style Tip: Pair with dark jeans for a smart-casual look, or tuck it into a pair of tailored trousers for a more polished outfit. Brown leather accessories or shoes will elevate your look effortlessly.",
      "price": 699,
      "rating": 3.6,
      "stock": 10,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false

    },
    {
      "id": "19",
      "type": "Shirts",
      "image": "/assets/images/img_menShirt9.jpg",
      "alt": "White Shirt",
      "name": "White Shirt",
      "description":"Description: A wardrobe essential, the White Shirt offers timeless sophistication and versatility for any occasion. This classic piece combines clean, crisp lines with a breathable and comfortable fit, making it an ideal choice for both professional and casual wear. Its pristine white color enhances its elegance, while the high-quality fabric ensures durability and long-lasting wear.Perfect for layering under jackets, pairing with chinos or jeans, or wearing solo for a fresh and polished look, the White Shirt is a go-to piece that never goes out of style. Whether you're dressing up for a formal event or down for a casual outing, this shirt will always have you looking sharp and confident. Style Tip: For a sharp business look, tuck it into tailored trousers and pair with leather shoes. For a more casual look, leave it untucked over jeans or shorts with sneakers.",
      "price": 799,
      "rating": 4.1,
      "stock": 13,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": false

    },
    {
      "id": "20",
      "type": "Shirts",
      "image": "/assets/images/img_menShirt10.jpg",
      "alt": "Shirt",
      "name": "Blue Denim Shirt",
      "description":"Description: The Blue Denim Shirt is a versatile and stylish staple that adds a touch of rugged charm to any wardrobe. Made from high-quality denim, this shirt offers a comfortable fit and a classic, timeless design. The rich blue color and durable fabric make it perfect for both casual and semi-formal occasions, providing an effortlessly cool look that never goes out of style.Whether you’re layering it over a t-shirt, pairing it with chinos or jeans, or wearing it open for a laid-back vibe, this shirt is sure to elevate any outfit. With its sturdy construction and modern yet classic appeal, the Blue Denim Shirt is an essential piece for those who appreciate both style and functionality.Style Tip: For a relaxed, rugged look, wear it untucked over a t-shirt with your favorite jeans. Alternatively, button it up and layer it under a leather jacket for a stylish contrast.",
      "price": 599,
      "rating": 4.3,
      "stock": 18,
      "button": "Add to Cart",
      "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
      "newArrival": true
    },
    {
      "id": "21",
      "type": "Jeans",
      "image": "/assets/images/img_menJeans1.jpg",
      "alt": "Jeans",
      "name": "Blue Jeans",
      "description":"Blue jeans are a timeless and versatile wardrobe staple, known for their durability and comfort. Typically made from denim, a sturdy cotton fabric, blue jeans come in a variety of styles, cuts, and washes. The classic blue color, often achieved through indigo dyeing, gives jeans their iconic look, though the shade can range from light to dark, with options like acid-washed, distressed, or faded finishes adding character and texture.Blue jeans are available in different fits, including skinny, slim, straight, bootcut, and relaxed, allowing for various styling choices based on body type and personal preference. The five-pocket design, with two in the front, two in the back, and a small coin pocket, is a common feature, though some styles may have additional details like zippers or belt loops.Blue jeans are incredibly versatile and can be dressed up or down depending on the occasion. Pairing them with a simple t-shirt or hoodie creates a casual look, while dressing them up with a button-down shirt or blazer offers a more polished appearance. Blue jeans can be worn year-round and are appropriate for a wide range of occasions, from casual outings to semi-formal events, making them an essential piece in any wardrobe.",
      "price": 1199,
      "rating": 4.4,
      "stock": 20,
      "button": "Add to Cart",
      "sizes": ["26", "28", "30", "32", "34", "36", "38", "40"],
      "newArrival": true

    },
    {
      "id": "22",
      "type": "Jeans",
      "image": "/assets/images/img_menJeans2.jpg",
      "alt": "Jeans",
      "name": "Black Slim Fit Jeans",
      "description":"Black slim-fit jeans are a modern, stylish, and versatile addition to any wardrobe. Made from a blend of cotton and stretch fabrics, these jeans offer a sleek and tailored silhouette that hugs the body without being too tight. The black color adds a touch of sophistication and is incredibly easy to style, making them suitable for both casual and semi-formal occasions. The slim-fit design of these jeans is cut closer to the body through the thigh and tapers down towards the ankle, creating a clean and streamlined look. This makes them ideal for those who prefer a more fitted, contemporary style. Black slim-fit jeans come in a variety of washes, from deep jet black to faded or distressed finishes, allowing for different levels of formality and edge.These jeans are highly versatile and can be dressed up or down. For a casual look, pair them with a simple t-shirt or hoodie and sneakers for a comfortable yet stylish appearance. To elevate the outfit for more formal settings, pair them with a button-down shirt or a blazer and boots or dress shoes. Black slim-fit jeans are perfect for those seeking a polished, modern, and adaptable piece for everyday wear, date nights, or even office casual settings.",
      "price": 1099,
      "rating": 4.2,
      "stock": 10,
      "button": "Add to Cart",
      "sizes": ["26", "28", "30", "32", "34", "36", "38", "40"],
      "newArrival": true
    },
    {
      "id": "23",
      "type": "Jeans",
      "image": "/assets/images/img_menJeans3.jpg",
      "alt": "Jeans",
      "name": "Dark Wash Jeans",
      "description":"Dark wash jeans are a classic and versatile wardrobe essential, known for their deep indigo or black color that adds a polished, refined look. The dark wash, achieved through a deeper dyeing process, gives these jeans a sophisticated, uniform appearance with minimal fading, making them suitable for both casual and semi-formal occasions. Unlike lighter washes, dark wash jeans have a more sleek and structured feel, which makes them easier to dress up.Typically available in various cuts—such as skinny, straight-leg, bootcut, or relaxed—dark wash jeans can flatter different body types and personal preferences. The richness of the dark color enhances the jeans' overall versatility, allowing them to be paired effortlessly with a wide range of shirts, jackets, and accessories.For casual outfits, dark wash jeans work well with t-shirts, polos, or sweaters. To elevate the look, pair them with a button-down shirt, blazer, or even a sweater vest for a smart-casual ensemble. Dark wash jeans are also an excellent choice for occasions that require a slightly more polished appearance, like dinner outings, date nights, or casual Fridays at work. Their ability to blend both comfort and style makes dark wash jeans a timeless and indispensable piece in any wardrobe.",
      "price": 1499,
      "rating": 4.1,
      "stock": 15,
      "button": "Add to Cart",
      "sizes": ["26", "28", "30", "32", "34", "36", "38", "40"],
      "newArrival": false

    },
    {
      "id": "24",
      "type": "Jeans",
      "image": "/assets/images/img_menJeans4.jpg",
      "alt": "Jeans",
      "name": "Light Blue Jeans",
      "description":"Light blue jeans offer a casual, relaxed vibe, making them a perfect choice for warmer weather or laid-back occasions. Made from denim, they typically feature a faded, washed-out blue hue, achieved through a light dye or special treatments that give them a worn-in, vintage look. The lighter shade provides a more casual, airy feel compared to darker washes, making them ideal for summer or spring outings.Available in various cuts such as slim, straight, skinny, or relaxed, light blue jeans can complement a variety of body types and personal styles. Their versatility makes them easy to dress up or down, depending on the occasion. For a casual look, pair them with a t-shirt, casual shirt, or a lightweight sweater, along with sneakers or loafers. You can also style them with a denim jacket or a hoodie for a laid-back, coordinated outfit. For a more polished appearance, try pairing light blue jeans with a button-down shirt or a blazer for a smart-casual look.Light blue jeans work especially well with pastel colors, white, or neutral tones, and their lighter nature offers a refreshing contrast when paired with darker shirts or jackets. Whether you're going for a relaxed daytime look or a casual evening outfit, light blue jeans are a versatile and stylish option that exudes comfort and effortless charm.",
      "price": 999,
      "rating": 4.3,
      "stock": 18,
      "button": "Add to Cart",
      "sizes": ["26", "28", "30", "32", "34", "36", "38", "40"],
      "newArrival": false

    },
    {
      "id": "25",
      "type": "Jeans",
      "image": "/assets/images/img_menJeans5.jpg",
      "alt": "Jeans",
      "name": "Grey Slim Fit Jeans",
      "description":"Grey slim-fit jeans offer a modern, sleek, and versatile alternative to traditional blue denim, making them a stylish choice for a variety of occasions. The slim-fit cut provides a tailored, close-to-the-body silhouette that is both flattering and contemporary, tapering from the thigh down to the ankle for a streamlined look. The neutral grey color adds sophistication and depth, making these jeans easy to pair with almost anything in your wardrobe.Grey slim-fit jeans can be dressed up or down depending on the occasion. For a casual look, pair them with a simple t-shirt, hoodie, or casual shirt, and finish with sneakers or boots. If you're aiming for a more polished appearance, grey slim-fit jeans can be styled with a button-down shirt, a blazer, or even a sweater, creating a sharp, smart-casual outfit that works well for evenings out, office wear, or a date night.The versatility of grey allows it to pair easily with a range of colors, from bold tones like red or navy to muted shades like black, white, or pastels. Grey slim-fit jeans are also ideal for creating contrast in your outfit, offering a neutral base that lets your top or accessories stand out. Whether you're looking for a casual everyday outfit or something a bit more refined, grey slim-fit jeans are a key piece for a well-rounded wardrobe.",
      "price": 1299,
      "rating": 4.0,
      "stock": 10,
      "button": "Add to Cart",
      "sizes": ["26", "28", "30", "32", "34", "36", "38", "40"],
      "newArrival": false
    }
  ]
  