[
  {
    "id": "200",
    "type": "co-ords",
    "image": "/assets/images/img_kids3.jpg",
    "alt": "Boys Co-ords",
    "name": "Boys co-ords",
    "price": "499",
    "description":"Elevate your little one's style with our trendy Boys' Co-Ords Set, designed to combine comfort and fashion effortlessly. Made from premium, breathable fabric, this set ensures all-day ease while keeping your child looking sharp. Featuring a coordinated top and bottom with modern prints or solid colors, it’s perfect for casual outings, family gatherings, or playdates. The elasticated waistband ensures a snug fit, while the durable material makes it easy to wash and maintain, ideal for active kids. Whether worn together for a cohesive look or mixed and matched with other pieces, this versatile set is a must-have addition to your child’s wardrobe. Make every day stylish with this perfect blend of practicality and charm!",
    "rating": 4.2,
      "stock": 15,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "button": "Add to Cart"
  },
  {
    "id": "201",
    "type": "shirts",
    "image": "/assets/images/img_boy2.jpg",
    "alt": "Boys Shirt",
    "name": "White Shirt",
    "description":"Add timeless elegance to your little one's wardrobe with this classic Boys' White Shirt, perfect for every occasion. Crafted from soft, breathable fabric, this shirt offers unmatched comfort while ensuring a polished and stylish appearance. Designed with a crisp collar, button-down front, and a tailored fit, it’s ideal for formal events, school functions, or casual outings when paired with jeans or shorts. The high-quality material ensures durability and easy maintenance, making it a practical choice for parents. Whether styled with trousers for a smart look or layered under a jacket for added sophistication, this white shirt is a versatile essential that never goes out of fashion.",
    "rating": 4.5,
      "stock": 8,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price": "499",
    "button": "Add to Cart"
  },
  {
    "id": "202",
    "type": "pant",
    "image": "/assets/images/img_boy3.jpg",
    "alt": "Casual Set",
    "name": "Casual pant",
    "description":"Keep your little one effortlessly stylish with our Boys' Casual Co-Ords, designed for comfort and versatility. Made from soft, breathable fabric, this coordinated set features a trendy top and matching bottoms, perfect for playdates, outings, or lounging at home. With its relaxed fit and modern design, it offers both style and ease of movement, ensuring your child stays comfortable all day long. Easy to mix and match with other wardrobe pieces, this set is a practical and fashionable addition to any boy’s closet. Durable and easy to care for, it’s the ideal choice for active kids who love to look cool without compromising on comfort.",
    "rating": 4.0,
      "stock": 12,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price": "899",
    "button": "Add to Cart"
  },
  {
    "id": "203",
    "type": "frock",
    "image": "/assets/images/img_girl1.jpg",
    "alt": "Pink Frock",
    "name": "Pink Frock",
    "description":"Dress your little one in charm and elegance with our Girls' Pink Frock, perfect for any special occasion or casual outing. Crafted from soft, lightweight fabric, this frock ensures all-day comfort while its vibrant pink hue adds a touch of playfulness and grace. Featuring delicate detailing, a flattering fit, and a breezy silhouette, it’s designed to make your princess feel confident and stylish. Whether paired with cute sandals for a daytime look or accessorized for a party-ready ensemble, this frock is a versatile and delightful addition to her wardrobe. Easy to care for and made to last, it’s a perfect blend of beauty and practicality.",
    "rating": 4.8,
      "stock": 6,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price": "899",
    "button": "Add to Cart"
  },
  {
    "id": "204",
    "type": "frock",
    "image": "/assets/images/img_girls2.jpg",
    "alt": "Checked Frock",
    "name": "Checked Frock",
    "description":"Bring timeless charm to your little one’s wardrobe with our Checked Frock, a perfect mix of style and comfort. Designed with a classic checkered pattern, this frock exudes effortless elegance, making it ideal for casual outings, family gatherings, or playdates. Crafted from soft, breathable fabric, it ensures all-day comfort and ease of movement. Featuring a flattering fit, delicate detailing, and a twirl-worthy silhouette, it’s both fun and fashionable. Pair it with cute sandals or sneakers for a versatile look that’s easy to style. Durable and easy to maintain, this checked frock is a must-have for every little fashionista!",
    "rating": 3.9,
      "stock": 10,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price": "899",
    "button": "Add to Cart"
  },
  {
    "id": "205",
    "type": "frock",
    "image": "/assets/images/img_girl3.jpg",
    "description":"Dress your little princess in adorable style with our Baby Girls’ Frock, designed to make her look and feel delightful. Made from soft, skin-friendly fabric, this frock ensures maximum comfort for your baby’s delicate skin. The charming design features playful patterns, delicate embellishments, and a breezy silhouette, perfect for any occasion, from family gatherings to casual outings. Lightweight and easy to wear, it allows freedom of movement for your little one to play and explore comfortably. Pair it with cute shoes and a matching headband for an irresistibly cute look. Easy to care for and crafted with love, this frock is a perfect blend of beauty and practicality for your baby girl!",
    "alt": "Frock",
    "name": "Frock",
    "rating": 4.1,
    "stock": 20,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price": "899",
    "button": "Add to Cart"
  },
  {
    "id":"206",
    "type":"co-ords",
    "alt":"green co-ords",
    "name":"green co-ords",
    "rating":3.9,
    "stock":5,
    "description":"Let your little fashionista shine with our Girls' Green Co-Ords, a chic and comfortable outfit perfect for any occasion. Made from soft, breathable fabric, this coordinated set includes a stylish top and matching bottoms in a vibrant green hue that’s both trendy and timeless. Designed for versatility, the set can be worn together for a polished look or mixed and matched with other wardrobe favorites. With its relaxed fit and durable construction, it ensures all-day comfort and ease of movement, making it ideal for playdates, outings, or family gatherings. Effortlessly stylish and easy to maintain, these co-ords are a must-have for your little one’s wardrobe!",
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price":799,
    "button":"Add to Cart",
    "image":"/assets/images/img_kids2.jpg"
  },
  {
    "id":"207",
    "type":"co-ords",
    "alt":"orange co-ords",
    "name":"orange co-ords",
    "description":"Brighten up your little one’s wardrobe with our Girls' Orange Co-Ords, a trendy and vibrant outfit perfect for any occasion. Made from soft, breathable fabric, this set includes a stylish top and matching bottoms in a cheerful orange hue that’s sure to make her stand out. The relaxed fit and lightweight design ensure all-day comfort, whether she’s at a playdate, family gathering, or simply enjoying a day out. Versatile and easy to style, the co-ords can be worn together for a coordinated look or mixed and matched with other favorites. Durable and easy to care for, this outfit is as practical as it is fashionable, making it a must-have for your little trendsetter!",
    "rating":4.9,
    "stock":10,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price":779,
    "button":"Add to Cart",
    "image":"/assets/images/img_kids4.jpg"
  },
  {
    "id":"208",
    "type":"co-ords",
    "alt":"co-ords",
    "name":"t-shirt and pant co-ords",
    "description":"Keep your little one comfy and stylish with our Baby Boys' T-Shirt and Pant Set, perfect for everyday adventures. Crafted from soft, breathable fabric, this adorable set ensures your baby stays comfortable all day long. The T-shirt features playful prints and a relaxed fit, while the matching pants come with an elasticated waistband for a snug and secure fit. Designed for ease of movement, this outfit is ideal for playdates, outings, or cozy days at home. Durable and easy to care for, it’s a practical and charming addition to your baby boy’s wardrobe, combining style and comfort effortlessly!",
    "rating":5,
    "stock":50,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price":899,
    "button":"Add to Cart",
    "image":"/assets/images/img_kids5.jpg"
  },
  {
    "id":"209",
    "type":"onesie",
    "alt":"onesie",
    "name":"baby onesies",
    "description":"Wrap your little one in comfort and cuteness with our Baby Onesie, designed to keep your baby snug and stylish all day long. Made from soft, breathable cotton, this onesie offers ultimate comfort for your baby’s delicate skin. With its easy snap closure and stretchy fabric, dressing your little one is quick and hassle-free. The adorable designs and pastel colors make it perfect for everyday wear, whether it's a cozy day at home or a fun outing. Easy to wash and maintain, this onesie is a must-have for any baby’s wardrobe.",
    "rating":4.3,
    "stock":9,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price":299,
    "button":"Add to Cart",
    "image":"/assets/images/img_onesie1.jpg"
  },
  {
    "id":"210",
    "type":"onesie",
    "alt":"onesie",
    "name":"baby onesies",
    "description":"Our Baby Onesie is the perfect blend of comfort, convenience, and charm. Made from high-quality, soft cotton fabric, it’s gentle on your baby’s skin and ideal for all-day wear. Featuring convenient snap buttons for easy diaper changes, this onesie is designed to make dressing and undressing quick and simple. The cute prints and bright colors add a playful touch to your baby’s wardrobe, while the stretchy material ensures freedom of movement for all of their little adventures. Easy to care for and built to last, this onesie is a staple for every baby’s collection.",
    "rating":3.8,
    "stock":19,
    "sizes": ["S", "M", "L", "XL", "XXL", "XXXL"],
    "price":469,
    "button":"Add to Cart",
    "image":"/assets/images/img_onesie2.jpg"
  } 
]
